#include "Engine.h"

void Engine::draw()
{
	m_Window.clear(Color::White);                                    // Очищаем экран перед отрисовкой
//-------------------------------------------------------------------------------------------------------------------------------
	m_Window.draw(m_BackgroundSprite);                               // Отрисовка задний фон
//-------------------------------------------------------------------------------------------------------------------------------
	m_Window.draw(m_Player.getSprite());                             // Отрисовка игрока
//-------------------------------------------------------------------------------------------------------------------------------
	m_Window.display();                                              // Вывод изображения на экран
}