#include "Engine.h"

Engine::Engine()
{
	Vector2f resolution;                                                // Переменная для хранения разрешения экрана
	resolution.x = VideoMode::getDesktopMode().width;                   // Ширина экрана
	resolution.y = VideoMode::getDesktopMode().height;                  // Высота экрана
//-------------------------------------------------------------------------------------------------------------------------------
	m_Window.create(VideoMode(resolution.x, resolution.y),              // Создание окна для рендеринга
		"SimpleGameEngine",                                             // Название окна
		Style::Fullscreen);                                             // Открываем в полноэкранном режиме
//-------------------------------------------------------------------------------------------------------------------------------
	m_BackgroundTexture.loadFromFile("Textures\\Background_Textures\\TryBackGround.png");
	m_BackgroundSprite.setTexture(m_BackgroundTexture); 
}
//-------------------------------------------------------------------------------------------------------------------------------
void Engine::start()
{
	Clock clock;                                                          // Таймер
//-------------------------------------------------------------------------------------------------------------------------------
	while (m_Window.isOpen())                                             // Цикл "Пока окно открыто"
	{
		Time dt = clock.restart();                                        // Перезапуск таймера
//-------------------------------------------------------------------------------------------------------------------------------
		float dtAsSeconds = dt.asSeconds();                               // Значение времени, прошедшего с начала новой итерации цикла
//-------------------------------------------------------------------------------------------------------------------------------
		input();
		update(dtAsSeconds);
		draw();
	}
}

// TODO: Реализовать функцию загрузки объектов.