#ifndef ENGINE_H
#define ENGINE_H

#include <SFML/Graphics.hpp>
#include "Player/Player.h"

using namespace sf;

class Engine
{
private:
	RenderWindow m_Window;                 // Окно для отрисовки спрайтов
//-------------------------------------------------------------------------------------------------------------------------------
	Sprite m_BackgroundSprite;             // Спрайт заднего фона
	Texture m_BackgroundTexture;           // Текстура заднего фона
//-------------------------------------------------------------------------------------------------------------------------------
	Player m_Player;                       // Объект игрока
//-------------------------------------------------------------------------------------------------------------------------------
	void input();                          // Функция для получения ввода
	void update(float dtAsSeconds);        // Функция для обновления позиции спрайтов
	void draw();                           // Функция для отрисовки спрайтов
//-------------------------------------------------------------------------------------------------------------------------------
public:
	Engine();                              // Конструктор игрового движка
//-------------------------------------------------------------------------------------------------------------------------------
	void start();                          // Функция, которая запускает движок в main() функции
};

#endif // !ENGINE_H
