#ifndef PLAYER_H
#define PLAYER_H

#include <SFML/Graphics.hpp>

using namespace sf;

class Player
{
//-------------------------------------------------------------------------------------------------------------------------------
private:
	Vector2f m_PlayerPosition;// Позиция игрока
//-------------------------------------------------------------------------------------------------------------------------------
	Sprite m_PlayerSprite;    // Спрайт игрока  
//-------------------------------------------------------------------------------------------------------------------------------
	Texture m_PlayerSkinL;    // Скин клавиши налево
	Texture m_PlayerSkinLU;   // Скин клавиши налево + вверх
	Texture m_PlayerSkinU;    // Скин клавиши вверх
	Texture m_PlayerSkinRU;   // Скин клавиши вверх + вправо
	Texture m_PlayerSkinR;    // Скин клавиши вправо
	Texture m_PlayerSkinRD;   // Скин клавиши вправо + вниз
	Texture m_PlayerSkinD;    // Скин клавиши вниз
	Texture m_PlayerSkinLD;   // Скин клавиши влево + вниз
//-------------------------------------------------------------------------------------------------------------------------------
	bool m_LeftPressed;       // Если клавиша влево нажата - true
	bool m_RightPressed;      // Если клавиша вправо нажата - true
	bool m_UpPressed;         // Если клавиша вверх нажата - true
	bool m_DownPressed;       // Если клавиша вниз нажата - true
//-------------------------------------------------------------------------------------------------------------------------------
	bool m_IsWallLeft;        // Если слева стена - true
	bool m_IsWallRight;       // Если справа стена - true
	bool m_IsWallUp;          // Если сверху стена - true
	bool m_IsWallDown;        // Если снизу стена - true
//-------------------------------------------------------------------------------------------------------------------------------
	float m_PlayerSpeed;      // Скорость игрока в пикселях в секунду
//-------------------------------------------------------------------------------------------------------------------------------
	short m_PlayerDirection;  // Направление игрока в данный момент
//-------------------------------------------------------------------------------------------------------------------------------
public:
	Player();                 // Конструктор игрока
//-------------------------------------------------------------------------------------------------------------------------------
	Sprite getSprite();       // Возвращает спрайт игрока
//-------------------------------------------------------------------------------------------------------------------------------
	void moveLeft();          // Счётчик нажатия на клавишу влево
	void moveRight();         // Счётчик нажатия на клавишу вправо
	void moveUp();            // Счётчик нажатия на клавишу вверх
	void moveDown();          // Счётчик нажатия на клавишу вниз
//-------------------------------------------------------------------------------------------------------------------------------
	void stopLeft();          // Вызывается, когда отпускают клавишу влево
	void stopRight();         // Вызывается, когда отпускают клавишу вправо
	void stopUp();            // Вызывается, когда отпускают клавишу вверх
	void stopDown();          // Вызывается, когда отпускают клавишу вниз
//-------------------------------------------------------------------------------------------------------------------------------
	void setDirection();      // Вызывается для изменения скина направления игрока
	short getDirection();     // Вызывается для получения направления игрока
//-------------------------------------------------------------------------------------------------------------------------------
	void update(float elapsedTime); // Вызывается для обновления местоположения и скина спрайта
};

#endif // !PLAYER_H
